Revit 2024 API
ExternalApplicationArray.Size Property
Returns the number of objects that are in the array.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Size { get; }
Visual Basic
Public Overridable ReadOnly Property Size As Integer
	Get
Visual C++
public:
virtual property int Size {
	int get ();
}
See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace